{
  "main": {
    "name": "Haramrit Singh Khurana",
    "occupation": "Software Engineer",
    "description": "Currently doing full-stack development using Spring Boot, Java, Angular, Oracle-SQL, Python, and Shell Scripting",
    "image": "profile-pic-new.png",
    "employer": "Citibank N.A.",
    "bio": "I'm a Senior Software Engineer (AVP) at Citi, building automation pipelines, ingestion systems, and internal tools that help 500+ dev teams ship faster and safer.\n\nI work mostly with Java, Spring Boot, Angular, Oracle SQL, and recently led a Playwright testing initiative that cut manual regression effort by 60%. I enjoy solving problems that affect systems at scale — especially if it means developers get fewer headaches.\n\nI'm AWS-certified, casually dangerous with Python and shell scripts, and always curious about how things work under the hood. Let's just say \"saving time and improving dev flow\" is kinda my thing.",
    "contactmessage": "Got a role that involves backend systems, platform tooling, or building things devs actually enjoy using?\nHit me up — email, LinkedIn, or even better, schedule a Zoom through Calendly. Always happy to chat tech (or coffee, if we're being honest ☕).",
    "email": "haramrit09k@gmail.com",
    "phone": "703-341-9667",
    "address": {
      "street": "123 Rock Fern Way",
      "city": "Toronto",
      "state": "ON",
      "zip": "M2J 4P4"
    },
    "website": "http://haramrit09k.github.io",
    "resumedownload": "/resume/Haramrit_Khurana_Resume.pdf",
    "social": [
      {
        "name": "linkedin",
        "url": "https://www.linkedin.com/in/haramrit09k/",
        "className": "fa fa-linkedin"
      },
      {
        "name": "instagram",
        "url": "https://www.instagram.com/haramrit09k",
        "className": "fa fa-instagram"
      },
      {
        "name": "github",
        "url": "https://www.github.com/haramrit09k",
        "className": "fa fa-github"
      },
      {
        "name": "email",
        "url": "mailto:haramrit09k@gmail.com",
        "className": "fa fa-envelope"
      }
    ]
  },
  "resume": {
    "skillmessage": "I'm always exploring new tools, but these are the ones I've used to solve real-world engineering problems — from backend automation and platform tooling to frontend dashboards and performance tuning.",
    "education": [
      {
        "school": "George Mason University",
        "degree": "Masters in Computer Science",
        "graduated": "Class of 2021",
        "description": "GPA: 3.76/4.0",
        "achievements": "Relevant Coursework: Algorithms, Systems Programming, Object Oriented Design, Database Systems, Component-based Software Engineering"
      },
      {
        "school": "University of Mumbai",
        "degree": "Bachelors in Computer Engineering",
        "graduated": "Class of 2019",
        "description": "GPA: 8.58/10.0",
        "achievements": "2nd runner up -  Mumbai Hackathon (2017), 1st runner up - Best Senior Thesis"
      }
    ],
    "work": [

      {
        "company": "Citibank N.A.",
        "roles": [
          {
            "title": "Engineer Sr Analyst",
            "years": "December 2022 - Present",
            "description": "• <strong>Led the Playwright automation project</strong> from inception to completion, independently conducting R&D, defining the technical roadmap, and establishing an efficient task breakdown strategy to accelerate execution. \n • Managed project planning and task distribution, creating JIRAs, assigning development tasks to a junior colleague, and ensuring timely implementation of core regression testing. \n • Successfully integrated the Playwright test suite into Jenkins for nightly builds, <strong>reducing manual testing efforts by 60% per RFT cycle</strong> and allowing developers to focus on feature validation instead of repetitive regression tests. \n • Ensured regression testing as the team transitions from DMA automation (Microfocus) to Ansible playbooks, leveraging the Playwright suite to maintain stability during the migration. \n • <strong>Spearheaded the Ops Manager Metrics Tab</strong> for MongoDB clusters, enabling users to view a summary of Ops Manager monitoring data directly within the portal without requiring a separate login, <strong>improving accessibility and reducing the need for manual navigation between multiple systems</strong>. \n • Optimized UAT and production deployment by introducing a <strong>divide-and-conquer testing strategy</strong> and SQL aggregation techniques, ensuring faster releases and database consistency across environments. \n • <strong>Closed 62+ high-impact JIRAs</strong>, showcasing strong problem-solving and full-stack development expertise across Angular and Spring Boot. \n • Oversaw <strong>onboarding</strong> of multiple new colleagues, both <strong>senior and junior</strong>, ensuring they were set up for their day-to-day work while continuing to meet my own deliverables and action items on time."
          }
        ]
      },

      {
        "company": "Optimal Satcom Inc",
        "roles": [
          {
            "title": "Software Engineer",
            "years": "June 2021 - October 2022",
            "description": "• Migrated firm-wide legacy applications to web applications using DevExpress React, ASP.NET Core, and MS-SQL \n • Implemented three major components using C# and responsible for all future enhancements along with bug fixes of those components \n • Responsible for fixing key components of critical silent console crashes reported by clients and deprecation issues integral to the security of the application \n • Created and modified SQL triggers, queries, stored procedures, and database upgrade scripts for new releases of the enterprise SATCOM capacity management system for clients \n • Developed and revitalized report generation functionality which provides meaningful insights and decoding useful patterns for external stakeholders \n • Spearheaded a project-wide initiative to introduce a third mode of operation to the company's flagship product, ECM \n • Collaborated closely with support and QA team to reproduce and fix high priority bugs reported by clients \n • Handled tech debt by optimizing and restructuring unused and deprecated legacy code and <strong>achieving a ~70% decrease in number of compiler warnings and errors</strong> \n"
          }
        ]
      },

      {
        "company": "Nexus 8 International",
        "roles": [
          {
            "title": "Software Engineer Intern ",
            "years": "May 2020 - August 2020",
            "description": "• Individually developed two major web components using <strong>ASP.NET Core</strong> framework and <strong>Blazor</strong> in compliance with <strong>HIPAA</strong> \n • <strong>Optimized</strong> the image upload process and decreased the upload time by 30% on average \n • Developed test cases and <strong>performed unit testing</strong> of the application before release to the stakeholders \n • Identified and analyzed new business and functional requirements as a part of requirement gathering sessions with customers"
          }
        ]
      },

      {
        "company": "George Mason University",
        "roles": [
          {
            "title": "Graduate Teaching Assistant",
            "years": "August 2019 - present",
            "description": "• Working as a Graduate Teaching Assistant and Lab Instructor for the course Applied IT Programming (IT 207) at GMU, instructing and grading the students on HTML, CSS, PHP and MySQL coursework. Resolve any student queries throughout the course. \n • Assisting two faculty instructors by teaching a batch of 60 students in recitation, laboratory, and discussion sessions, helping software users in a Computer laboratory."
          }
        ]
      },

      {
        "company": "Don Bosco Institute of Technology",
        "roles": [
          {
            "title": "Backend Developer Intern",
            "years": "June 2018 - December 2018",
            "description": "• Developed the plan and <strong>headed the team</strong> that implemented remodeling of the website Don Bosco Journal of Science and Engineering using <strong>Node.js, Express</strong> and <strong>MongoDB </strong>\n • <strong>Designed</strong> and <strong>implemented</strong> a secure <strong>tag-based paper-reviewer matching algorithm</strong> to automate the review assignment process"
          },
          {
            "title": "Technical Head - ACM DBIT",
            "years": "July 2017 - May 2018",
            "description": "• Organized Teknack, a two-day intercollegiate online gaming festival featuring more than 10 games (Single-Player, Multi-Player & Open World) \n • Games were played over 25000 people, a significant markup of 28 % from Teknack '17"
          }
        ]
      }

    ],
    "skills": [
      {
        "name": "Java",
        "description": "My go-to language for building backend systems, data pipelines, and APIs. Strong foundation in OOP, threading, and modular design.",
        "image": "java.jpg"
      },
      {
        "name": "Spring Boot",
        "description": "Used heavily for building microservices, ingestion endpoints, and backend config tools. Clean, testable, and easy to scale.",
        "image": "spring-boot.png"
      },
      {
        "name": "Playwright",
        "description": "Led an enterprise automation project with Playwright — built nightly test pipelines, integrated with Jenkins, and slashed manual QA work by 60%.",
        "image": "playwright.png"
      },
      {
        "name": "Angular",
        "description": "Built full-featured admin and diagnostic UIs for internal platforms used by 500+ teams. Strong with services, forms, and state management.",
        "image": "react.jpg"
      },
      {
        "name": "Oracle SQL",
        "description": "Written some gnarly queries, optimized joins, handled migrations, and debugged issues across environments. Used in most of my production work.",
        "image": "mongo.jpg"
      },
      {
        "name": "Node.js",
        "description": "First love. Built full-stack apps in Node, Express, and MongoDB — used it for research portals, games, and side projects.",
        "image": "node.jpg"
      },
      {
        "name": "AWS",
        "description": "AWS-certified. Used for cloud automation, deployment, and scaling solutions.",
        "image": "aws.gif"
      },
      {
        "name": "Python & Shell",
        "description": "Casually dangerous with Python and shell scripts for automation, data wrangling, and dev tooling.",
        "image": "git.jpg"
      },
      {
        "name": "CI/CD (Jenkins & GitHub Actions)",
        "description": "Automated build and regression pipelines using Jenkins and GitHub Actions. Integrated testing workflows to ensure high release confidence across environments.",
        "image": "ci-cd.png"
      },
      {
        "name": "Test Automation",
        "description": "Led end-to-end test automation initiatives using Playwright, achieving 60% reduction in manual QA. Designed scalable test suites integrated with CI/CD workflows.",
        "image": "test-automation.png"
      },
      {
        "name": "REST APIs",
        "description": "Designed and consumed RESTful APIs across multiple projects. Built backend services and integrated third-party endpoints with robust error handling.",
        "image": "rest-api.png"
      },
      {
        "name": "Shell Scripting & Python",
        "description": "Used for automation, data parsing, and internal tooling. Created efficient scripts to support operations and reduce manual overhead.",
        "image": "python-shell.png"
      },
      {
        "name": "Monitoring & Logging (Grafana / Kibana)",
        "description": "Worked with monitoring dashboards and logs to debug production issues, ensure observability, and maintain uptime in live systems.",
        "image": "monitoring.png"
      }
    ]
  },
  "portfolio": {
    "projects": [
      {
        "title": "NumPy for C",
        "category": "Open source project focused on augmenting the C library",
        "image": "numpy-for-c.png",
        "url": "https://github.com/AkashG6/New-C-Library"
      },
      {
        "title": "Dist-ML",
        "category": "Capstone project, won 1st runner up in annual project competition, Tech stack: Electron.js, ",
        "image": "dist-ml.png",
        "url": "https://youtu.be/q6aFGrotY4c"
      },
      {
        "title": "IPL Predictor",
        "category": "Predicting the results of IPL 2020 using Data Science",
        "image": "ipl.jpeg",
        "url": "https://github.com/haramrit09k/ipl-predictor"
      },
      {
        "title": "Hippra",
        "category": "Healthcare collaboration app, Tech stack: ASP.NET Core, Blazor, SQL",
        "image": "hippra.png",
        "url": "https://www.hippra.com/"
      },
      {
        "title": "SpaceTerra",
        "category": "Voted as most played game of Teknack, Tech stack: Phaser.io, MongoDB, Node.js",
        "image": "space-terra.png",
        "url": "https://spaceterra.herokuapp.com"
      },
      {
        "title": "DBJSE",
        "category": "Research paper review portal, Tech stack: Node.js, Express and MongoDB",
        "image": "dbit-logo.png",
        "url": "https://gitlab.com/aarish407/DBJSE"
      },
      {
        "title": "Portfolio Website",
        "category": "My portfolio website, Tech stack: ReactJS, GitHub Pages",
        "image": "portfolio.png",
        "url": "https://github.com/haramrit09k/haramrit09k.github.io"
      },
      {
        "title": "wha2do",
        "category": "Minimalistic todo Android app, Tech stack: React Native, Firebase",
        "image": "wha2do.png",
        "url": "https://play.google.com/store/apps/details?id=com.wha2do"
      },
      {
        "title": "rockX",
        "category": "A simple Angular app displaying SpaceX recent launches, Tech stack: Angular, GraphQL",
        "image": "rockX.webp",
        "url": "https://rock-x.herokuapp.com"
      },
      {
        "title": "Stock Price Dashboard",
        "category": "A stock price dashboard built using Python, Streamlit and Yahoo Finance API",
        "image": "stock.png",
        "url": "https://streamlit-stock-price.herokuapp.com/"
      }
    ]
  },
  "testimonials": {
    "testimonials": [
      {
        "text": "It's rare that you come across standout talent like Haramrit. \n\n I had the pleasure of working with Haramrit for 6 months at the Nexus 8 International, collaborating on several projects. \n\n I was particularly impressed by Haramrit's ability to quickly learn a new technology and handle even the toughest issues—effortlessly. That skill often takes years to develop professionals, but it seemed to come perfectly naturally to him. \n\nHaramrit would be an asset to any team.",
        "user": "Jason Chen - CTO, Nexus 8 International"
      },
      {
        "text": "That Haramrit Singh Khurana must be one of the most brilliant developers I've ever met! It is surprising that nobody has hired him yet. Hey you, you should hire this guy, he may be fresh out of University and have hardly any job experience but I am confident that he will be one of your best developers in no time!",
        "user": "Steve Wozniak... impersonator"
      }
    ]
  }
}
