{
  "main": {
    "name": "Haramrit Singh Khurana",
    "occupation": "Software Engineer",
    "description": "Over 1 year of experience working with modern day technologies like .NET Core, C#, React, and MS-SQL.",
    "image": "profilepic.jpg",
    "employer": "Optimal Satcom Inc",
    "bio": "I am a software engineer with over 1 year of experience at Optimal Satcom Inc, and have a good grasp on <strong>.NET Core, C#, and MS-SQL</strong>. My zeal for learning about cloud technologies led me to getting certified as an <strong>AWS Solutions Architect - Associate</strong>. I am passionate about creating quality software chunks that help make this world a better place. Along with possessing effective problem-solving skills, I am also an excellent communicator with strong analytical and organizational skills.",
    "contactmessage": "Have a project for me? Think I'd be a good fit for your team? I'd love to hear from you, give me a shout by email, via LinkedIn or call me on my cellphone. \n OR <strong><u>you could schedule a Zoom call with me using Calendly!</u></strong> :)",
    "email": "haramrit09k@gmail.com",
    "phone": "703-341-9667",
    "address": {
      "street": "13504 Avonmore Dr",
      "city": "Herndon",
      "state": "Virginia",
      "zip": "20171"
    },
    "website": "http://haramrit09k.github.io",
    "resumedownload": "/resume/Haramrit_Khurana_Resume.pdf",
    "social": [
      {
        "name": "linkedin",
        "url": "https://www.linkedin.com/in/haramrit09k/",
        "className": "fa fa-linkedin"
      },
      {
        "name": "instagram",
        "url": "https://www.instagram.com/haramrit09k",
        "className": "fa fa-instagram"
      },
      {
        "name": "github",
        "url": "https://www.github.com/haramrit09k",
        "className": "fa fa-github"
      },
      {
        "name": "email",
        "url": "mailto:haramrit09k@gmail.com",
        "className": "fa fa-envelope"
      }
    ]
  },
  "resume": {
    "skillmessage": "I'm a dilettante and am always interested in playing around with new technologies but these are the ones that have really won me over",
    "education": [
      {
        "school": "George Mason University",
        "degree": "Masters in Computer Science",
        "graduated": "Graduating May 2021",
        "description": "GPA: 3.76/4.0",
        "achievements": "Relevant Coursework: Algorithms, Systems Programming, Object Oriented Design, Database Systems, Component-based Software Engineering"
      },
      {
        "school": "University of Mumbai",
        "degree": "Bachelors in Computer Engineering",
        "graduated": "Class of 2019",
        "description": "GPA: 8.58/10.0",
        "achievements": "2nd runner up -  Mumbai Hackathon (2017), 1st runner up - Best Senior Thesis"
      }
    ],
    "work": [
      {
        "company": "Optimal Satcom Inc",
        "roles": [
          {
            "title": "Software Engineer",
            "years": "June 2021 - October 2022",
            "description": "• Migrated firm-wide legacy applications to web applications using DevExpress React, ASP.NET Core, and MS-SQL \n • Implemented three major components using C# and responsible for all future enhancements along with bug fixes of those components \n • Responsible for fixing key components of critical silent console crashes reported by clients and deprecation issues integral to the security of the application \n • Created and modified SQL triggers, queries, stored procedures, and database upgrade scripts for new releases of the enterprise SATCOM capacity management system for clients \n • Developed and revitalized report generation functionality which provides meaningful insights and decoding useful patterns for external stakeholders \n • Spearheaded a project-wide initiative to introduce a third mode of operation to the company’s flagship product, ECM \n • Collaborated closely with support and QA team to reproduce and fix high priority bugs reported by clients \n • Optimized and restructured unused and deprecated legacy code and achieved a ~70% decrease in number of compiler warnings and errors \n"
          }
        ]
      },

      {
        "company": "Nexus 8 International",
        "roles": [
          {
            "title": "Software Engineer Intern ",
            "years": "May 2020 - August 2020",
            "description": "• Individually developed two major web components using <strong>ASP.NET Core</strong> framework and <strong>Blazor</strong> in compliance with <strong>HIPAA</strong> \n • <strong>Optimized</strong> the image upload process and decreased the upload time by 30% on average \n • Developed test cases and <strong>performed unit testing</strong> of the application before release to the stakeholders \n • Identified and analyzed new business and functional requirements as a part of requirement gathering sessions with customers"
          }
        ]
      },

      {
        "company": "George Mason University",
        "roles": [
          {
            "title": "Graduate Teaching Assistant",
            "years": "August 2019 - present",
            "description": "• Working as a Graduate Teaching Assistant and Lab Instructor for the course Applied IT Programming (IT 207) at GMU, instructing and grading the students on HTML, CSS, PHP and MySQL coursework. Resolve any student queries throughout the course. \n • Assisting two faculty instructors by teaching a batch of 60 students in recitation, laboratory, and discussion sessions, helping software users in a Computer laboratory."
          }
        ]
      },

      {
        "company": "Don Bosco Institute of Technology",
        "roles": [
          {
            "title": "Backend Developer Intern",
            "years": "June 2018 - December 2018",
            "description": "• Developed the plan and <strong>headed the team</strong> that implemented remodeling of the website Don Bosco Journal of Science and Engineering using <strong>Node.js, Express</strong> and <strong>MongoDB </strong>\n • <strong>Designed</strong> and <strong>implemented</strong> a secure <strong>tag-based paper-reviewer matching algorithm</strong> to automate the review assignment process"
          },
          {
            "title": "Technical Head - ACM DBIT",
            "years": "July 2017 - May 2018",
            "description": "• Organized Teknack, a two-day intercollegiate online gaming festival featuring more than 10 games (Single-Player, Multi-Player & Open World) \n • Games were played over 25000 people, a significant markup of 28 % from Teknack ‘17"
          }
        ]
      }

    ],
    "skills": [
      {
        "name": "Git",
        "description": "I use Git for all of my projects so far. I have mostly used Git for version control in small teams.",
        "image": "git.jpg"
      },
      {
        "name": "Java",
        "description": "Java was my second programming language that I started using (after C) in college a couple years ago. It is by far the language I am most familiar with in data-structure and algorithm programming.",
        "image": "java.jpg"
      },
      {
        "name": "ReactJS",
        "description": "I am fairly new to React and found it a bit confusing at first. However, I realized how powerful and easy to use it is, once I got the hang of it. This website is also made using React. ",
        "image": "react.jpg"
      },
      {
        "name": "AWS",
        "description": "For this, I just have one word - AMAZING! I used some of the services to host a couple course projects, but after that, I wanted to learn more. And hence I got certified as an AWS Solutions Architect - Associate.",
        "image": "aws.gif"
      },
      {
        "name": "Docker & Kubernetes",
        "description": "I came across these terms in grad school, and after having used them for a couple course projects, I realized how important and relevant containerization and orchestration are in the industry today.",
        "image": "docker-kubernetes.png"
      },
      {
        "name": "Node.js",
        "description": "I developed my first application with Node.js back in 2016, and have never looked back since. It has become my server-side scripting language of choice. The bulk of my experience with it has been in conjunction with using MongoDB as the supporting database.",
        "image": "node.jpg"
      },
      {
        "name": "Bootstrap 4",
        "description": "I was introduced to Bootstrap during a web dev workshop I attended in late 2015, and honestly I was blown away with what you could do with a simple CSS framework. Since then, I have used Bootstrap more often than not when designing the layout for my sites.",
        "image": "bootstrap.png"
      },
      {
        "name": "MongoDB",
        "description": "I have used many different database systems and am better educated and experienced with Relational Databases. However, for many applications, especially Node.js applications that I have worked on, I found MongoDB to be a better alternative for those use cases.",
        "image": "mongo.jpg"
      }
    ]
  },
  "portfolio": {
    "projects": [
      {
        "title": "NumPy for C",
        "category": "Open source project focused on augmenting the C library",
        "image": "numpy-for-c.png",
        "url": "https://github.com/AkashG6/New-C-Library"
      },
      {
        "title": "Dist-ML",
        "category": "Capstone project, won 1st runner up in annual project competition, Tech stack: Electron.js, ",
        "image": "dist-ml.png",
        "url": "https://youtu.be/q6aFGrotY4c"
      },
      {
        "title": "IPL Predictor",
        "category": "Predicting the results of IPL 2020 using Data Science",
        "image": "ipl.jpeg",
        "url": "https://github.com/haramrit09k/ipl-predictor"
      },
      {
        "title": "Hippra",
        "category": "Healthcare collaboration app, Tech stack: ASP.NET Core, Blazor, SQL",
        "image": "hippra.png",
        "url": "https://www.hippra.com/"
      },
      {
        "title": "SpaceTerra",
        "category": "Voted as most played game of Teknack, Tech stack: Phaser.io, MongoDB, Node.js",
        "image": "space-terra.png",
        "url": "https://spaceterra.herokuapp.com"
      },
      {
        "title": "DBJSE",
        "category": "Research paper review portal, Tech stack: Node.js, Express and MongoDB",
        "image": "dbit-logo.png",
        "url": "https://gitlab.com/aarish407/DBJSE"
      },
      {
        "title": "Portfolio Website",
        "category": "My portfolio website, Tech stack: ReactJS, GitHub Pages",
        "image": "portfolio.png",
        "url": "https://github.com/haramrit09k/haramrit09k.github.io"
      },
      {
        "title": "wha2do",
        "category": "Minimalistic todo Android app, Tech stack: React Native, Firebase",
        "image": "wha2do.png",
        "url": "https://play.google.com/store/apps/details?id=com.wha2do"
      },
      {
        "title": "rockX",
        "category": "A simple Angular app displaying SpaceX recent launches, Tech stack: Angular, GraphQL",
        "image": "rockX.webp",
        "url": "https://rock-x.herokuapp.com"
      },
      {
        "title": "Stock Price Dashboard",
        "category": "A stock price dashboard built using Python, Streamlit and Yahoo Finance API",
        "image": "stock.png",
        "url": "https://streamlit-stock-price.herokuapp.com/"
      }
    ]
  },
  "testimonials": {
    "testimonials": [
      {
        "text": "It’s rare that you come across standout talent like Haramrit. \n\n I had the pleasure of working with Haramrit for 6 months at the Nexus 8 International, collaborating on several projects. \n\n I was particularly impressed by Haramrit's ability to quickly learn a new technology and handle even the toughest issues—effortlessly. That skill often takes years to develop professionals, but it seemed to come perfectly naturally to him. \n\nHaramrit would be an asset to any team.",
        "user": "Jason Chen - CTO, Nexus 8 International"
      },
      {
        "text": "That Haramrit Singh Khurana must be one of the most brilliant developers I've ever met! It is surprising that nobody has hired him yet. Hey you, you should hire this guy, he may be fresh out of University and have hardly any job experience but I am confident that he will be one of your best developers in no time!",
        "user": "Steve Wozniak... impersonator"
      }
    ]
  }
}
